export const ARTICLE_DATA = [
  {
    id: 'kMFzSKRZ_6',
    type: 'h1',
    children: [
      {
        text: '1. Начало',
        color: 'inherit',
      },
    ],
  },
  {
    id: 'hcTfmaLACj',
    type: 'p',
    children: [
      {
        text: 'Угу.. Кто тут? Я смотрю, к нам присоединился доброволец? Да-да, конечно входите, ворота в web3 же не резиновые.. – проворчал бородатый синьор, стоящий у ворот. На всех места хватит.',
      },
    ],
  },
  {
    id: 'uItS5naLB3',
    type: 'p',
    children: [
      {
        text: 'Ох и ворчливый он – стражник. Но ему можно – после долгой и ответственной карьеры он  был назначен охранять ворота в веб3. Через него проходят все новички, желающие начать свой путь в веб3.',
      },
    ],
  },
  {
    id: 'uQRIq9dM37',
    type: 'p',
    children: [
      {
        text: 'Привет. Если вы читаете эти строки, подтверждаем, что это уроки Solidity. Наш обучающий курс напичкан практикой (1500+ практических задач) и рассчитан на взрослую аудиторию. Скучные лекции — не наш формат, поэтому BlockFirst написан в виде онлайн-игры (квеста).',
      },
    ],
  },
  {
    id: '1kJxJ-iLPo',
    type: 'p',
    children: [
      {
        text: 'Если вы никогда не программировали и не разбираетесь в устройстве блокчейна, если вам за 30, и вы решили сменить профессию, если учиться программировать по книгам вам скучно или просто лень(!), BlockFirst — это именно то, что вам нужно. Обучение Solidity с нуля с элементами игры — это круто!',
      },
    ],
  },
  {
    id: '642GLnsOP4',
    type: 'p',
    children: [
      {
        text: 'Вам приходилось раньше играть и прокачивать персонажей? Иногда и не замечаешь, как втягиваешься, да? Догадываетесь, на что намек? В BlockFirst вы тоже будете прокачивать персонажа. ',
      },
      {
        bold: true,
        text: 'Решите проблемы всех героев — станете крутым блокчейн разрабом.',
      },
    ],
  },
  {
    id: 'Accjg7cPLA',
    type: 'p',
    children: [
      {
        text: 'Пусть вас не смущает легкий и приключенческий формат курса. Он создан специалистами в своей области и содержит все самые актуальные и важные знания, которые помогут вам развить необходимые навыки для успешной карьеры. А приключенческий стиль поможет пройти курс до конца в увлекательном формате',
      },
    ],
  },
  {
    id: 'mWWw8dMtmG',
    type: 'p',
    children: [
      {
        text: 'Пройдете базовый курс — сможете устроиться на работу как Solidity middle. Некоторые студенты находят работу даже в процессе обучения, одновременно получая опыт работы в компании и допроходя курс для расширения знаний. Все это возможно потому, что в BlockFirst много актуального кода и практических задач. Очень много.',
      },
    ],
  },
  {
    id: 'OxPywQcbzK',
    type: 'h1',
    children: [
      { text: '2' },
      {
        text: '. Герои',
        color: 'inherit',
      },
    ],
  },
  {
    id: 'Jep3J29ES8',
    type: 'p',
    children: [
      {
        text: 'В прохождении игры вам помогут наши герои, которые будут исследовать мир блокчейна вместе с вами. Вы погрузитесь в ситуации практического применения децентрализованных технологий и узнаете, как они могут изменить ваше восприятие финансов и взаимодействий в цифровом пространстве.',
      },
    ],
  },
  {
    id: 'rpTwa-8wHs',
    type: 'p',
    children: [
      { bold: true, text: 'Алекс.' },
      {
        text: ' Стартапер и предприниматель. Мечтает о создании проекта–единорога. Пока его попытки запустить успешный проект не увенчались успехом, но однажды у него обязательно получится…',
      },
    ],
  },
  {
    id: '2vet5quVrt',
    type: 'p',
    children: [
      { bold: true, text: 'Вася.' },
      {
        text: ' Житель далекого-далекого будущего, в котором произошла децентрализованная революция. Он наблюдает за миром, где технологии и свобода переплелись в уникальном симбиозе',
      },
    ],
  },
  {
    id: '4Z6wint6-r',
    type: 'p',
    children: [
      { bold: true, text: 'Дима.' },
      {
        text: ' Начинающий сисадмин. Обожает гудящие железные-ящики – сервера, и мечтает запустить свою сеть блокчейн нод. Он проводит бессонные ночи, смотря ютуб гайды про web3',
      },
    ],
  },
  {
    id: 'Xi4wm2vxoS',
    type: 'p',
    children: [
      {
        text: 'События разворачиваются в самых разных уголках времени и пространства, но их объединяет одно – энтузиасты, не боящиеся сложных челленджей и готовых учиться чтобы сделать будущее настоящим.',
      },
    ],
  },
  {
    id: 'lKnVUP1Lqb',
    type: 'p',
    children: [
      {
        text: 'Однажды давным-давно в далекой Галактике был произведен первый блок...',
      },
    ],
  },
  {
    id: 'SVctd1Aa3J',
    type: 'hr',
    children: [
      {
        text: '',
        color: 'rgb(23, 43, 83)',
      },
    ],
  },
  {
    id: '-xb-HWWfSy',
    type: 'h1',
    children: [
      { text: '3', color: 'inherit' },
      {
        text: '. Знакомство с Алексом',
        color: 'inherit',
      },
    ],
  },
  {
    id: 'EMtNEY02Re',
    type: 'p',
    children: [
      {
        text: 'Наше первое приключение мы начнем вместе с Алексом. Мы поможем запустить ему новый проект, ',
      },
    ],
  },
  {
    id: 'gDhTd1zJ6u',
    url: 'https://cdn.javarush.com/images/article/6af1d88e-67b3-4138-90a9-65aa9afc646e/1024.webp',
    type: 'img',
    children: [
      {
        text: '',
        color: 'rgb(23, 43, 83)',
      },
    ],
  },
  {
    id: 'DmeiXf53xo',
    type: 'hr',
    children: [
      {
        text: '',
        color: 'rgb(23, 43, 83)',
      },
    ],
  },
  {
    id: 'uY1xZOgr0B',
    type: 'h1',
    children: [
      { text: '4', color: 'inherit' },
      {
        text: '. В добрый путь',
        color: 'inherit',
      },
    ],
  },
  {
    id: 'R0u-aD9Jjv',
    type: 'p',
    children: [
      {
        text: 'Вы начинаете с первого уровня. Ваша задача – помочь героям преодолеть сложности',
        color: 'inherit',
      },
      {
        bold: true,
        text: '.',
        color: 'inherit',
      },
      {
        text: ' Но давайте начнем с малого: сначала дойдите до второго уровня уроков по Solidity на BlockFirst. Может быть, вам так понравится, что вы не заметите, как пройдете весь курс и пойдете работать 😉',
        color: 'inherit',
      },
    ],
  },
  {
    id: '0b2R-SAO-_',
    type: 'p',
    children: [
      {
        bold: true,
        text: 'P.S.',
        color: 'inherit',
      },
      {
        text: ' А теперь перейдем к обучению — жмите на кнопку ',
        color: 'inherit',
      },
      {
        bold: true,
        text: '«Следующее занятие»',
        color: 'inherit',
      },
    ],
  },
];
